# Программа угадывания слова из 
# 5 букв
# для Тинькофф

def begin_screen # Очистка экрана (для Linux)
end

def alphavit
end

def control_world
  
end

def out_hh_b
  puts $hh_b
end

#            0        1         2         3
#            12345678901234567890123456789012 
alphavit = 'АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЬЫЪЭЮЯ'

arr_b = alphavit.split("") # ['А', 'Б', 'В', 'Г', 'Д', 'Е', ... 'Я']
arr_0 = [0,0]              # Два флага для описания состояния буквы [0,1]
                           # 0-ой - буква в слове ОТСУТСТВУЕТ  = [1,_]
                           # 1-ый - буква в слове ПРИСУТСТВУЕТ = [_,1]
			   #   если по данной букве НЕТ ДАННЫХ = [0,0]
			   #       ошибочное состояние массива = [1,1]

puts alphavit              # DEBUG
puts arr_b                 # DEBUG
puts arr_0                 # DEBUG

$hh_b = {}                  # Хэш для описания состояний букв
arr_b.each do |item|

  $hh_b [item] = arr_0

end

puts $hh_b                  # DEBUG
 
c_word = 'ВЕДРО' # Претендент
target = 'КРЫЛО' # Целевое (искомое) слово - оно программе не известно



hh_tablo = {'1' => {'Y' => '-', 'N' => []},
	    '2' => {'Y' => '-', 'N' => []}, 
	    '3' => {'Y' => '-', 'N' => []}, 
	    '4' => {'Y' => '-', 'N' => []}, 
	    '5' => {'Y' => '-', 'N' => []}
	    }

out_hh_b
